In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv("/content/HRDataset_v14.csv")

In [17]:
df.head()

,Employee_Name,EmpID,MarriedID,MaritalStatusID,Gender,EmpStatusID,DeptID,PerfScoreID,FromDiversityJobFairID,Salary,...,PerformanceRating,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,"Adinolfi, Wilson K",10026.0,0.0,0.0,Female,1.0,5.0,4.0,0.0,62506.0,...,3,80,0,8,0,1,6,4,0,5
1,"Ait Sidi, Karthikeyan",10084.0,1.0,1.0,Male,5.0,3.0,3.0,0.0,104437.0,...,4,80,1,10,3,3,10,7,1,7
2,"Akinkuolie, Sarah",10196.0,1.0,1.0,Male,5.0,5.0,3.0,0.0,64955.0,...,3,80,0,7,3,3,0,0,0,0
3,"Alagbe,Trina",10088.0,1.0,1.0,Female,1.0,5.0,3.0,0.0,64991.0,...,3,80,0,8,3,3,8,7,3,0
4,"Anderson, Carol",10069.0,0.0,2.0,Male,5.0,5.0,3.0,0.0,50825.0,...,3,80,1,6,3,3,2,2,2,2

Warning: Total number of columns (56) exceeds max_columns (20) limiting to first (20) columns.

In [ ]:
#1

In [13]:
df.loc[df["Position"]=="Production Technician I"].Position.count()

137

In [ ]:
#2

In [35]:
df.loc[df["Gender"]=="Male"].Employee_Name

1      Ait Sidi, Karthikeyan
2             Akinkuolie, Sarah
4              Anderson, Carol
5             Anderson, Linda
7                   Athwal, Sam
                 ...
306              Woodson, Jason
308            Zamora, Jennifer
309                 Zhou, Julia
310               Zima, Colleen
311                         NaN
Name: Employee_Name, Length: 194, dtype: object

In [ ]:
#3

In [38]:
df.loc[df["ManagerName"]=="Michael Albert"].Employee_Name

0         Adinolfi, Wilson  K
14              Barton, Nader
23             Blount, Dianna
41           Chace, Beatrice
58          Crimmings,   Jean
83             Erilus, Angela
84          Estremera, Miguel
102           Gentry, Mildred
122       Handschiegl, Joanne
129    Homberger, Adrienne  J
143           Johnson, George
148           Keatts, Kramer
168         Linares, Marilyn
171              Lundy, Susan
186        Medeiros, Jennifer
195         Moumanil, Maliki
209             Owad, Clinton
229            Rarrick, Quinn
247             Sadki, Nore
256          Sloan, Constance
272         Sullivan, Timothy
294      Von Massenbach, Anna
Name: Employee_Name, dtype: object

In [24]:
#4

In [37]:
df.loc[df["EmploymentStatus"]=="Active"].Employee_Name

0      Adinolfi, Wilson  K
3             Alagbe,Trina
5        Anderson, Linda
6          Andreola, Colby
7              Athwal, Sam
              ...
305          Wolk, Hang  T
306         Woodson, Jason
308       Zamora, Jennifer
309            Zhou, Julia
310          Zima, Colleen
Name: Employee_Name, Length: 207, dtype: object

In [27]:
#5

In [28]:
df.loc[df["EmploymentStatus"]=="Active"]
df.loc[df["MaritalDesc"]=="Married"].Employee_Name

1      Ait Sidi, Karthikeyan
2             Akinkuolie, Sarah
3                  Alagbe,Trina
10         Baczenski, Rachael
11              Barbara, Thomas
                 ...
288             Valentin,Jackie
292             Voldemort, Lord
293               Volk, Colleen
296        Wallace, Courtney  E
301               Wilber, Barry
Name: Employee_Name, Length: 124, dtype: object

In [29]:
#6

In [43]:

df.loc[(df["Salary"]>60000) & (df["EmploymentStatus"]=="Active")].Employee_Name

0      Adinolfi, Wilson  K
3             Alagbe,Trina
6          Andreola, Colby
12        Barbossa, Hector
16        Beak, Kimberly
              ...
299        Warfield, Sarah
305          Wolk, Hang  T
306         Woodson, Jason
308       Zamora, Jennifer
309            Zhou, Julia
Name: Employee_Name, Length: 135, dtype: object

In [44]:
#7

In [48]:
df.loc[(df["Position"]=="Production Technician II") & (df["EngagementSurvey"]==df["EngagementSurvey"].max())]

,Employee_Name,EmpID,MarriedID,MaritalStatusID,Gender,EmpStatusID,DeptID,PerfScoreID,FromDiversityJobFairID,Salary,...,PerformanceRating,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
123,"Hankard, Earnest",10074.0,0.0,0.0,Male,1.0,5.0,3.0,0.0,64246.0,...,3,80,0,23,5,3,20,18,15,15
127,"Hendrickson, Trina",10075.0,0.0,0.0,Male,5.0,5.0,3.0,0.0,68099.0,...,3,80,0,0,2,2,0,0,0,0
177,"Manchester, Robyn",10077.0,1.0,1.0,Male,2.0,5.0,3.0,0.0,62385.0,...,4,80,0,1,3,2,1,0,1,0
178,"Mancuso, Karen",10073.0,1.0,1.0,Female,5.0,5.0,3.0,0.0,68407.0,...,4,80,3,24,2,3,24,13,15,7
182,"Carthy, B'rigit",10076.0,0.0,0.0,Female,1.0,5.0,3.0,0.0,55315.0,...,4,80,0,4,5,2,4,3,0,2
206,"Oliver, Brooke",10078.0,1.0,1.0,Male,5.0,5.0,3.0,0.0,71966.0,...,3,80,1,4,2,2,4,2,2,2
304,"Winthrop, Jordan",10033.0,0.0,0.0,Male,5.0,5.0,4.0,0.0,70507.0,...,3,80,3,19,5,2,18,10,3,7

In [49]:
#8

In [54]:
a=df.Salary.max()
df.loc[df["Salary"]==250000.0].Position

150    President & CEO
Name: Position, dtype: object

In [55]:
#9

In [61]:
x=df.Salary.mean()
df.loc[df["Salary"]<x].Employee_Name

0        Adinolfi, Wilson  K
2          Akinkuolie, Sarah
3               Alagbe,Trina
4           Anderson, Carol
5          Anderson, Linda
               ...
303    Williams, Jacquelyn
305            Wolk, Hang  T
306           Woodson, Jason
307       Ybarra, Catherine
310            Zima, Colleen
Name: Employee_Name, Length: 221, dtype: object

In [ ]:
#10

In [62]:
x=df.Salary.mean()
df.[df["Salary"]<x]&df["EmpStatsfaction"]

SyntaxError: ignored